<?php

/** @var yii\web\View $this */
use yii\helpers\Url;

$this->title = Yii::t('custom', 'My Application');

?>
<div class="site-index">

    <div class="jumbotron text-center bg-transparent">
        <h1 class="display-4"><?= Yii::t('custom', 'Congratulations') ?>!</h1>
        <p class="lead">
            <div class="alert-custom">
                <p class="lead">Вітаємо вас, шановний користувач! 🎉</p>
                <p>Бажаємо вам мирного неба, продуктивної роботи та гарного настрою.<br>
                    Нехай ваш день буде сповнений нових досягнень, а звіти складатимуться легко й без помилок. <br>
                    Глибокого натхнення та успіхів у всіх ваших справах! ☀️</p>
                <hr>
                <p class="mb-0">З найкращими побажаннями, <strong>Звітобот</strong>.</p>
            </div>



        </p>

        <p><a class="btn btn-lg btn-success" href="<?= Url::to(['/site/about']) ?>">Позпочати роботу з документами</a></p>
    </div>

    <div class="body-content">
        <!-- Перша частина -->
        <div class="row">
            <div class="col-lg-4">
                <h2>Підготовка документації</h2>
                <p>Наша система надає можливість автоматичного генерування документів, таких як звіти, акти та рахунки, із точним підрахунком усіх необхідних даних. Всі документи створюються згідно заздалегідь підготовлених шаблонів та можуть бути завантажені у форматі Excel. Це дозволяє значно оптимізувати процеси, скорочує ризик помилок і економить час на підготовку документації. Система забезпечує повну автоматизацію формування фінансових та звітних документів, включаючи обчислення сум, дат, періодів та інших даних в підзвітних документах.</p>
            </div>

            <div class="col-lg-4">
                <h2>Лише один файл</h2>
                <p>Наш сервіс пропонує просте та зручне рішення: завантажте лише один файл, і в результаті ви отримаєте архів, який містить усі підготовлені звітні документи. Це значно спрощує процес, адже всі акти, рахунки та інші необхідні файли автоматично генеруються згідно з вашими даними, підраховуються всі необхідні показники, і все це зібрано в одному архіві. Ви отримуєте готовий комплект документів, які можна одразу використовувати для подачі звітності або передачі в банк.</p>
            </div>

            <div class="col-lg-4">
                <h2>Для ФОПів 3-ї групи</h2>
                <p>Наш сервіс підходить для ФОПів 3-ї групи, які регулярно подають звітність та здійснюють виплати через систему Admitad. Завдяки автоматичному генеруванню звітних документів, таких як акти, звіти та рахунки, сервіс значно спрощує процес підготовки звітності. Він автоматично підраховує всі необхідні дані, формує документи відповідно до вимог та дозволяє швидко завантажувати їх у форматі Excel для подальшого подання в банк. Це економить час, мінімізує ризики помилок і забезпечує точність в усіх розрахунках, що робить його незамінним інструментом для ФОПів, які працюють з Admitad.</p>
            </div>

            <div class="col-lg-4">
                <h2>Заповнення періоду</h2>
                <p>На цьому етапі ви вказуєте дату початку та завершення періоду, протягом якого відбувалися події, що стосуються звіту. Дати повинні бути введені у форматі дд.мм.рррр. Переконайтеся, що ці дати є коректними.</p>
            </div>

            <!-- Друга частина -->
            <div class="col-lg-4">
                <h2>Номера документів</h2>
                <p>Введіть порядковий номер документів у звітності за вказаний період. Це може бути номер договору, акта або іншого документа. Поле дозволяє вводити тільки цілі числа, тому переконайтеся у правильності введених даних.</p>
            </div>

            <!-- Третя частина -->
            <div class="col-lg-4">
                <h2>Завантаження файлу</h2>
                <p>Останній етап - це завантаження файлу. Ви можете завантажити файл у форматі .xlsx або .xls, який містить додаткові дані або документи, пов'язані з періодом. Після вибору файлу переконайтеся, що він успішно доданий.</p>
            </div>
        </div>
    </div>


</div>
